; ModuleID = 'pbeampp.c'
source_filename = "pbeampp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.arc = type { i32, i64, %struct.node*, %struct.node*, i16, %struct.arc*, %struct.arc*, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64, i64, i64 }
%struct.basket = type { %struct.arc*, i64, i64, i64 }

@full_group_end_arc = internal unnamed_addr global %struct.arc* null, align 8, !dbg !0

; Function Attrs: mustprogress nofree norecurse nosync nounwind uwtable willreturn
define dso_local void @set_static_vars(%struct.network* nocapture readonly %net, %struct.arc* %arcs) local_unnamed_addr #0 !dbg !56 {
entry:
  call void @llvm.dbg.value(metadata %struct.network* %net, metadata !102, metadata !DIExpression()), !dbg !104, !sourceFile !105, !mergedLineNum !106
  call void @llvm.dbg.value(metadata %struct.arc* %arcs, metadata !103, metadata !DIExpression()), !dbg !104, !sourceFile !105, !mergedLineNum !106

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "full_group_end_arc", scope: !2, file: !3, line: 30, type: !13, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.0 (git@github.com:kirshanthans/llvm-project-exp.git e1e02a5ce5d3dd50375b9bb4f022c9816d9495f8)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !12, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "pbeampp.c", directory: "/home/grads/srinivasanr/mcf")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !10}
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!12 = !{!0}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !15, line: 137, baseType: !16)
!15 = !DIFile(filename: "./defines.h", directory: "/home/grads/srinivasanr/mcf")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !15, line: 168, size: 576, elements: !17)
!17 = !{!18, !19, !22, !44, !45, !47, !48, !49, !50}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !16, file: !15, line: 170, baseType: !9, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !16, file: !15, line: 171, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !15, line: 98, baseType: !21)
!21 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !16, file: !15, line: 172, baseType: !23, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !15, line: 135, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !15, line: 149, size: 832, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !36, !37, !38, !39, !41, !42, !43}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !25, file: !15, line: 151, baseType: !20, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !25, file: !15, line: 152, baseType: !9, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !25, file: !15, line: 153, baseType: !23, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !25, file: !15, line: 154, baseType: !23, size: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !25, file: !15, line: 155, baseType: !23, size: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !25, file: !15, line: 156, baseType: !23, size: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !25, file: !15, line: 157, baseType: !34, size: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !15, line: 138, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !25, file: !15, line: 158, baseType: !34, size: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !25, file: !15, line: 158, baseType: !34, size: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !25, file: !15, line: 159, baseType: !34, size: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !25, file: !15, line: 160, baseType: !40, size: 64, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !15, line: 97, baseType: !21)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !25, file: !15, line: 161, baseType: !21, size: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !25, file: !15, line: 162, baseType: !9, size: 32, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !25, file: !15, line: 163, baseType: !9, size: 32, offset: 800)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !16, file: !15, line: 172, baseType: !23, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !16, file: !15, line: 173, baseType: !46, size: 16, offset: 256)
!46 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !16, file: !15, line: 174, baseType: !34, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !16, file: !15, line: 174, baseType: !34, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !16, file: !15, line: 175, baseType: !40, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !16, file: !15, line: 176, baseType: !20, size: 64, offset: 512)
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = !{i32 7, !"uwtable", i32 1}
!55 = !{!"clang version 14.0.0 (git@github.com:kirshanthans/llvm-project-exp.git e1e02a5ce5d3dd50375b9bb4f022c9816d9495f8)"}
!56 = distinct !DISubprogram(name: "set_static_vars", scope: !3, file: !3, line: 33, type: !57, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !101)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59, !13}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !15, line: 206, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !15, line: 181, size: 5184, elements: !62)
!62 = !{!63, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !61, file: !15, line: 183, baseType: !64, size: 1600)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 1600, elements: !66)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!66 = !{!67}
!67 = !DISubrange(count: 200)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !61, file: !15, line: 184, baseType: !64, size: 1600, offset: 1600)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !61, file: !15, line: 185, baseType: !21, size: 64, offset: 3200)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !61, file: !15, line: 185, baseType: !21, size: 64, offset: 3264)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !61, file: !15, line: 186, baseType: !21, size: 64, offset: 3328)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !61, file: !15, line: 186, baseType: !21, size: 64, offset: 3392)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !61, file: !15, line: 186, baseType: !21, size: 64, offset: 3456)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !61, file: !15, line: 186, baseType: !21, size: 64, offset: 3520)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !61, file: !15, line: 187, baseType: !21, size: 64, offset: 3584)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !61, file: !15, line: 187, baseType: !21, size: 64, offset: 3648)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !61, file: !15, line: 189, baseType: !21, size: 64, offset: 3712)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !61, file: !15, line: 190, baseType: !21, size: 64, offset: 3776)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !61, file: !15, line: 191, baseType: !21, size: 64, offset: 3840)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !61, file: !15, line: 192, baseType: !21, size: 64, offset: 3904)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !61, file: !15, line: 193, baseType: !21, size: 64, offset: 3968)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !61, file: !15, line: 194, baseType: !21, size: 64, offset: 4032)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !61, file: !15, line: 195, baseType: !21, size: 64, offset: 4096)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !61, file: !15, line: 196, baseType: !21, size: 64, offset: 4160)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !61, file: !15, line: 197, baseType: !21, size: 64, offset: 4224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !61, file: !15, line: 198, baseType: !87, size: 64, offset: 4288)
!87 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !61, file: !15, line: 199, baseType: !20, size: 64, offset: 4352)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !61, file: !15, line: 200, baseType: !23, size: 64, offset: 4416)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !61, file: !15, line: 200, baseType: !23, size: 64, offset: 4480)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !61, file: !15, line: 201, baseType: !34, size: 64, offset: 4544)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !61, file: !15, line: 201, baseType: !34, size: 64, offset: 4608)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !61, file: !15, line: 201, baseType: !34, size: 64, offset: 4672)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !61, file: !15, line: 202, baseType: !34, size: 64, offset: 4736)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !61, file: !15, line: 202, baseType: !34, size: 64, offset: 4800)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !61, file: !15, line: 203, baseType: !21, size: 64, offset: 4864)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !61, file: !15, line: 204, baseType: !21, size: 64, offset: 4928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !61, file: !15, line: 205, baseType: !21, size: 64, offset: 4992)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !61, file: !15, line: 205, baseType: !21, size: 64, offset: 5056)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !61, file: !15, line: 205, baseType: !21, size: 64, offset: 5120)
!101 = !{!102, !103}
!102 = !DILocalVariable(name: "net", arg: 1, scope: !56, file: !3, line: 33, type: !59)
!103 = !DILocalVariable(name: "arcs", arg: 2, scope: !56, file: !3, line: 33, type: !13)
!104 = !DILocation(line: 0, scope: !56)
!105 = !{!"pbeampp.c"}
!106 = !{!"0"}
!107 = !DILocation(line: 40, column: 36, scope: !56)
!108 = !{!"40"}
!109 = !{!110, !113, i64 632}
!110 = !{!"network", !111, i64 0, !111, i64 200, !113, i64 400, !113, i64 408, !113, i64 416, !113, i64 424, !113, i64 432, !113, i64 440, !113, i64 448, !113, i64 456, !113, i64 464, !113, i64 472, !113, i64 480, !113, i64 488, !113, i64 496, !113, i64 504, !113, i64 512, !113, i64 520, !113, i64 528, !114, i64 536, !113, i64 544, !115, i64 552, !115, i64 560, !115, i64 568, !115, i64 576, !115, i64 584, !115, i64 592, !115, i64 600, !113, i64 608, !113, i64 616, !113, i64 624, !113, i64 632, !113, i64 640}
!111 = !{!"omnipotent char", !112, i64 0}
!112 = !{!"Simple C/C++ TBAA"}
!113 = !{!"long", !111, i64 0}
!114 = !{!"double", !111, i64 0}
!115 = !{!"any pointer", !111, i64 0}
!116 = !DILocation(line: 40, column: 55, scope: !56)
!117 = !{!110, !113, i64 640}
!118 = !DILocation(line: 40, column: 48, scope: !56)
!119 = !DILocation(line: 40, column: 29, scope: !56)
!120 = !DILocation(line: 40, column: 22, scope: !56)
!121 = !{!115, !115, i64 0}
!122 = !DILocation(line: 41, column: 1, scope: !56)
!123 = !{!"41"}
!124 = distinct !DISubprogram(name: "bea_is_dual_infeasible", scope: !3, file: !3, line: 46, type: !125, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !127)
!125 = !DISubroutineType(types: !126)
!126 = !{!9, !13, !20}
!127 = !{!128, !129}
!128 = !DILocalVariable(name: "arc", arg: 1, scope: !124, file: !3, line: 46, type: !13)
!129 = !DILocalVariable(name: "red_cost", arg: 2, scope: !124, file: !3, line: 46, type: !20)
!130 = !DILocation(line: 0, scope: !124)
!131 = !DILocation(line: 53, column: 26, scope: !124)
!132 = !{!"53"}
!133 = !DILocation(line: 53, column: 30, scope: !124)
!134 = !DILocation(line: 53, column: 38, scope: !124)
!135 = !{!136, !138, i64 32}
!136 = !{!"arc", !137, i64 0, !113, i64 8, !115, i64 16, !115, i64 24, !138, i64 32, !115, i64 40, !115, i64 48, !113, i64 56, !113, i64 64}
!137 = !{!"int", !111, i64 0}
!138 = !{!"short", !111, i64 0}
!139 = !DILocation(line: 53, column: 44, scope: !124)
!140 = !DILocation(line: 54, column: 13, scope: !124)
!141 = !{!"54"}
!142 = !DILocation(line: 54, column: 26, scope: !124)
!143 = !DILocation(line: 54, column: 30, scope: !124)
!144 = !DILocation(line: 54, column: 38, scope: !124)
!145 = !DILocation(line: 54, column: 44, scope: !124)
!146 = !{!"-1"}
!147 = !DILocation(line: 53, column: 5, scope: !124)
!148 = distinct !DISubprogram(name: "cost_compare", scope: !3, file: !3, line: 61, type: !149, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !160)
!149 = !DISubroutineType(types: !150)
!150 = !{!9, !151, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASKET", file: !15, line: 146, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basket", file: !15, line: 140, size: 256, elements: !155)
!155 = !{!156, !157, !158, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !154, file: !15, line: 142, baseType: !13, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !154, file: !15, line: 143, baseType: !20, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "abs_cost", scope: !154, file: !15, line: 144, baseType: !20, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !154, file: !15, line: 145, baseType: !21, size: 64, offset: 192)
!160 = !{!161, !162, !163}
!161 = !DILocalVariable(name: "b1", arg: 1, scope: !148, file: !3, line: 61, type: !151)
!162 = !DILocalVariable(name: "b2", arg: 2, scope: !148, file: !3, line: 61, type: !151)
!163 = !DILocalVariable(name: "retval", scope: !148, file: !3, line: 68, type: !9)
!164 = !DILocation(line: 0, scope: !148)
!165 = !DILocation(line: 69, column: 8, scope: !166)
!166 = distinct !DILexicalBlock(scope: !148, file: !3, line: 69, column: 7)
!167 = !{!"69"}
!168 = !DILocation(line: 69, column: 26, scope: !166)
!169 = !DILocation(line: 73, column: 14, scope: !170)
!170 = distinct !DILexicalBlock(scope: !148, file: !3, line: 73, column: 7)
!171 = !{!"73"}
!172 = !{!173, !115, i64 0}
!173 = !{!"basket", !115, i64 0, !113, i64 8, !113, i64 16, !113, i64 24}
!174 = !DILocation(line: 73, column: 17, scope: !170)
!175 = !{!136, !137, i64 0}
!176 = !DILocation(line: 73, column: 29, scope: !170)
!177 = !DILocation(line: 73, column: 32, scope: !170)
!178 = !DILocation(line: 73, column: 20, scope: !170)
!179 = !DILocation(line: 73, column: 7, scope: !148)
!180 = !DILocation(line: 77, column: 3, scope: !148)
!181 = !{!"77"}
!182 = distinct !DISubprogram(name: "primal_bea_mpp", scope: !3, file: !3, line: 82, type: !183, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !187)
!183 = !DISubroutineType(types: !184)
!184 = !{!152, !21, !13, !13, !185, !151, !9, !186, !21, !21, !21}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!188 = !DILocalVariable(name: "m", arg: 1, scope: !182, file: !3, line: 82, type: !21)
!189 = !DILocalVariable(name: "arcs", arg: 2, scope: !182, file: !3, line: 82, type: !13)
!190 = !DILocalVariable(name: "stop_arcs", arg: 3, scope: !182, file: !3, line: 82, type: !13)
!191 = !DILocalVariable(name: "basket_sizes", arg: 4, scope: !182, file: !3, line: 83, type: !185)
!192 = !DILocalVariable(name: "perm", arg: 5, scope: !182, file: !3, line: 83, type: !151)
!193 = !DILocalVariable(name: "thread", arg: 6, scope: !182, file: !3, line: 83, type: !9)
!194 = !DILocalVariable(name: "end_arc", arg: 7, scope: !182, file: !3, line: 83, type: !186)
!195 = !DILocalVariable(name: "step", arg: 8, scope: !182, file: !3, line: 83, type: !21)
!196 = !DILocalVariable(name: "num_threads", arg: 9, scope: !182, file: !3, line: 83, type: !21)
!197 = !DILocalVariable(name: "max_elems", arg: 10, scope: !182, file: !3, line: 83, type: !21)
!198 = !DILocalVariable(name: "i", scope: !182, file: !3, line: 98, type: !21)
!199 = !DILocalVariable(name: "j", scope: !182, file: !3, line: 98, type: !21)
!200 = !DILocalVariable(name: "count", scope: !182, file: !3, line: 98, type: !21)
!201 = !DILocalVariable(name: "global_basket_size", scope: !182, file: !3, line: 98, type: !21)
!202 = !DILocalVariable(name: "next", scope: !182, file: !3, line: 98, type: !21)
!203 = !DILocalVariable(name: "arc", scope: !182, file: !3, line: 99, type: !13)
!204 = !DILocalVariable(name: "old_end_arc", scope: !182, file: !3, line: 99, type: !13)
!205 = !DILocalVariable(name: "red_cost", scope: !182, file: !3, line: 100, type: !20)
!206 = !DILabel(scope: !182, name: "NEXT", file: !3, line: 122)
!207 = !DILabel(scope: !182, name: "READY", file: !3, line: 172)
!208 = !DILocation(line: 0, scope: !182)
!209 = !DILocation(line: 102, column: 45, scope: !210)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 102, column: 8)
!211 = distinct !DILexicalBlock(scope: !182, file: !3, line: 102, column: 8)
!212 = !DILocation(line: 102, column: 37, scope: !210)
!213 = !{!113, !113, i64 0}
!214 = !{!"102"}
